In [1]:
import warnings
warnings.filterwarnings(action='ignore') 

import pandas as pd
import numpy as np
import csv
import folium
import matplotlib.pyplot as plt
plt.rc('font',family='D2CodingLigature Nerd Font')

In [2]:
df = pd.DataFrame({'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
                   'gender': ['F', np.nan, np.nan, 'M', 'F'],
                   'score': [89, 75, 95, np.nan, 93]})
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

In [3]:
pd.isna(df)   # 결측값 여부

    name  gender  score
0  False   False  False
1  False    True  False
2  False    True  False
3  False   False   True
4  False   False  False

In [ ]:
pd.isna(df).sum()   # True: 1, False: 0

name      0
gender    2
score     1
dtype: int64

In [ ]:
# 원본의 복사본을 만들고 복사본에 결측치가 있는 행을 제거 (원본의 훼손을 막기 위하여)

clean_df = df.dropna()
clean_df

      name gender  score
0  Jessica      F   89.0
4     Alex      F   93.0

In [9]:
# name과 score에 결측치가 있는 행 제거

clean_df2 = df.dropna(subset=['name', 'score'])
clean_df2

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [10]:
df.dropna(subset=['name', 'score'], inplace=True)   # 원본 데이터 수정
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
4     Alex      F   93.0

In [ ]:
df = pd.DataFrame({'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
                   'gender': ['F', np.nan, np.nan, 'M', 'F'],
                   'score': [89, 75, 95, np.nan, 93]})
df

      name gender  score
0  Jessica      F   89.0
1     Liam    NaN   75.0
2   Sophia    NaN   95.0
3     Ryan      M    NaN
4     Alex      F   93.0

In [12]:
df1 = df.fillna(0)      # 결측치를 0으로 대체
df1

      name gender  score
0  Jessica      F   89.0
1     Liam      0   75.0
2   Sophia      0   95.0
3     Ryan      M    0.0
4     Alex      F   93.0

In [ ]:
# gender의 결측치는 etc, score의 결측치는 score의 평균으로 대체 

df2 = df.fillna({'gender':'etc',  'score':df['score'].mean()})
df2

      name gender  score
0  Jessica      F   89.0
1     Liam    etc   75.0
2   Sophia    etc   95.0
3     Ryan      M   88.0
4     Alex      F   93.0

In [14]:
# 원본 변경

df.fillna({'gender':'etc',  'score':df['score'].mean()}, inplace=True)
df

      name gender  score
0  Jessica      F   89.0
1     Liam    etc   75.0
2   Sophia    etc   95.0
3     Ryan      M   88.0
4     Alex      F   93.0